# Parameter Type Id Rebar Crank Offset Multiplier Property

Source: https://www.revitapidocs.com/2026/ff39a397-5b5c-3b32-a29f-f35db7d91036.htm

---

| Parameter Type Id Rebar Crank Offset Multiplier Property |
| --- |

"Crank Offset Multiplier"
**Namespace:** Autodesk.Revit.DB
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public static ForgeTypeId RebarCrankOffsetMultiplier { get; }
```

```
Public Shared ReadOnly Property RebarCrankOffsetMultiplier As ForgeTypeId
	Get
```

```
public:
static property ForgeTypeId^ RebarCrankOffsetMultiplier {
	ForgeTypeId^ get ();
}
```

```
static member RebarCrankOffsetMultiplier : ForgeTypeId with get
```

#### Property Value

ForgeTypeId See Also

#### Reference

ParameterTypeId Class Autodesk.Revit.DB Namespace